Config/Catalogs/ПараметрыДоговораЭквайринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПараметрыДоговораЭквайринга</Name>
			<Comment>Параметры отражения платежей и комиссии банка-эквайера в учете</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЭквайринга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляРозничныхПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КБКНазначениеПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КОСГУНазначениеПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплатыУслугЭквайера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплатыУслугЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУчетаОбязательств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаОбязательствПоДоговоруЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатрат1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатрат2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатрат3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаЗатратНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатратНУ1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатратНУ2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЗатратНУ3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПервичныйДокументПриОплате</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦели</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦелиЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМероприятияЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКлассификацияЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКассовуюСсылку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеНДССКомиссииВРасходах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифыЗаРасчетноеОбслуживание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПлатежнойКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПлатежныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентТорговойУступки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойВид</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидаОплатыОфлайнККМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДССКомисии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДССКомиссииСверху</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Терминалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаполнениеПервичныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацииЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/СпособыОплатыУслугЭквайринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОплатыУслугЭквайринга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомиссияУдерживаетсяПриПроведенииПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияОплачиваетсяПослеПоступленияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ТипыПлановСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПлановСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляКазенных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляБюджетных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляАвтономных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОСубсидии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтправителемТрансферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученныйКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленнаяГарантия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИноеОбязательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ПараметрыДоговораЭквайринга/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(Объект.ЛицевойСчет));
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьЗаголовкиСубконтоЗатрат(ЭтаФорма, Объект, "СчетУчетаЗатрат");
	УстановитьЗаголовкиСубконтоЗатрат(ЭтаФорма, Объект, "СчетУчетаЗатратНУ");
	
	УстановитьДоступностьПараметровКомиссии(ЭтаФорма);
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	УстановитьВидимостьЭлементов(); 
	
	ТипМакетаКассовойСсылки = 7;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьСписокВыбораНаименований();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	УстановитьДоступностьЭлементовСБП();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособОплатыУслугЭквайераПриИзменении(Элемент)
	
	УстановитьДоступностьПараметровКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеИсточники(Объект.ЛицевойСчет));
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетКУПриИзменении(Элемент)
	
	Элементы.ИсточникСредств.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеИсточники(Объект.ЛицевойСчет));
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура КПСУчетаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(Элемент, СтандартнаяОбработка, Объект.КПСУчетаЗатрат,
		Объект.Организация, , Объект.КФО, Объект.СчетУчетаЗатрат, ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратПриИзменении(Элемент)
	
	УстановитьЗаголовкиСубконтоЗатрат(ЭтаФорма, Объект, "СчетУчетаЗатрат");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОграниченияСчета = Новый Массив;
	ОграниченияСчета.Добавить("401.20");
	ОграниченияСчета.Добавить("109.60");
	ОграниченияСчета.Добавить("109.70");
	ОграниченияСчета.Добавить("109.80");
	ОграниченияСчета.Добавить("109.90");
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.СчетУчетаЗатрат, 
																			Объект.КПСУчетаЗатрат, 
																			Объект.КФО), 
															Объект.Организация,
															,
															ОграниченияСчета,
															Объект.КФО,
															,
															ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															Объект.КПСУчетаЗатрат,
															,
															,);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3);
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратНУПриИзменении(Элемент)
	
	УстановитьЗаголовкиСубконтоЗатрат(ЭтаФорма, Объект, "СчетУчетаЗатратНУ");
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатратНУ1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатратНУ2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатратНУ3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, НомерСубконто)

	Если СтрНайти(Элемент.Имя, "СубконтоЗатратНУ") = 0 Тогда
		СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто(НомерСубконто,
			Объект.Организация, Объект.КФО, Объект.КПСУчетаЗатрат, ,
			Объект.СчетУчетаЗатрат, Объект.СубконтоЗатрат1, Объект.СубконтоЗатрат2, Объект.СубконтоЗатрат3);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
	Иначе
		СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто(НомерСубконто,
			Объект.Организация, Объект.КФО, , ,
			Объект.СчетУчетаЗатратНУ, Объект.СубконтоЗатратНУ1, Объект.СубконтоЗатратНУ2, Объект.СубконтоЗатратНУ3);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнятьПервичныйДокументПриОплатеПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТарифы

&НаКлиенте
Процедура ТарифыЗаРасчетноеОбслуживаниеОсновнойВидПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТарифыЗаРасчетноеОбслуживание.ТекущиеДанные;
	Если ТекущиеДанные.ОсновнойВид Тогда
		
		// Сбросим флаг "Основной" в остальных строках.
		Для каждого Тариф Из Объект.ТарифыЗаРасчетноеОбслуживание Цикл
			Если Тариф.НомерСтроки <> ТекущиеДанные.НомерСтроки Тогда
				Тариф.ОсновнойВид = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаполнениеПервичногоДокумента

&НаКлиенте
Процедура ЗаполнениеПервичныхДокументовВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСоздатьКонтрагентаИДоговорДляПлатежногоСервисаЮКасса(Команда)
	НайтиСоздатьКонтрагентаИДоговорДляПлатежногоСервисаЮКассаНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиСубконтоЗатрат(Форма, Объект, ИмяРеквизитаСчет)
	Перем МассивПолей;
	
	Если ИмяРеквизитаСчет = "СчетУчетаЗатрат" Тогда
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто1", "СубконтоЗатрат1", "ЗаголовокСубконтоЗатрат1", Истина, "СубконтоЗатрат1", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто2", "СубконтоЗатрат2", "ЗаголовокСубконтоЗатрат2", Истина, "СубконтоЗатрат2", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто3", "СубконтоЗатрат3", "ЗаголовокСубконтоЗатрат3", Истина, "СубконтоЗатрат3", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетУчетаЗатрат, Форма, Объект, МассивПолей);
		
	ИначеЕсли ИмяРеквизитаСчет = "СчетУчетаЗатратНУ" Тогда
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто1", "СубконтоЗатратНУ1", "ЗаголовокСубконтоЗатратНУ1", Истина, "СубконтоЗатратНУ1", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто2", "СубконтоЗатратНУ2", "ЗаголовокСубконтоЗатратНУ2", Истина, "СубконтоЗатратНУ2", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто3", "СубконтоЗатратНУ3", "ЗаголовокСубконтоЗатратНУ3", Истина, "СубконтоЗатратНУ3", Истина, Истина);
		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетУчетаЗатратНУ, Форма, Объект, МассивПолей);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПараметровКомиссии(Форма)
	
	Объект = Форма.Объект;
	
	КомиссияУдерживаетсяПриПроведенииПлатежа = (Объект.СпособОплатыУслугЭквайера = ПредопределенноеЗначение(
		"Перечисление.СпособыОплатыУслугЭквайринга.КомиссияУдерживаетсяПриПроведенииПлатежа"));
	
	Форма.Элементы.СтраницыНастрокиУчета.ТекущаяСтраница =
		?(КомиссияУдерживаетсяПриПроведенииПлатежа, Форма.Элементы.СтраницаНастройкиУчета, Форма.Элементы.СтраницаПустая);
		
	Форма.Элементы.ОтражениеНДССКомиссииВРасходах.Доступность = (Объект.СпособОплатыУслугЭквайера = ПредопределенноеЗначение(
		"Перечисление.СпособыОплатыУслугЭквайринга.КомиссияУдерживаетсяПриПроведенииПлатежа"));
	Если Объект.СпособОплатыУслугЭквайера = ПредопределенноеЗначение("Перечисление.СпособыОплатыУслугЭквайринга.КомиссияОплачиваетсяПослеПоступленияДенежныхСредств") Тогда 
		Объект.ОтражениеНДССКомиссииВРасходах = 0;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЗаполнениеПервичныхДокументов", "Видимость", Объект.ЗаполнятьПервичныйДокументПриОплате);
	
	ТекущийТипПланаСчетов = БухгалтерскийУчетПовтИсп.ТекущийТипПланаСчетов(Объект.Организация);
	Если ТекущийТипПланаСчетов = Перечисления.ТипыПлановСчетов.ДляКазенных Тогда
		ВидимостьЛицевойСчетКУ = Истина;	
	Иначе
		ВидимостьЛицевойСчетКУ = Ложь;	
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЛицевойСчетКУ", "Видимость", ВидимостьЛицевойСчетКУ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЛицевойСчет", "Видимость", НЕ ВидимостьЛицевойСчетКУ);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораНаименований()
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Эквайер) Тогда
		
		СписокВыбора.Добавить(СокрЛП(Объект.Эквайер));
		
		Если ЗначениеЗаполнено(Объект.ДоговорЭквайринга) Тогда
			ВариантНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2'"),
				СокрЛП(Объект.Эквайер), СокрЛП(Объект.ДоговорЭквайринга));
			СписокВыбора.Добавить(ВариантНаименования);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
			ВариантНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, л/с %2'"),
				СокрЛП(Объект.Эквайер), СокрЛП(Объект.ЛицевойСчет));
			СписокВыбора.Добавить(ВариантНаименования);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДопустимыеИсточники(ЛицевойСчет);
	
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ЛицевойСчет);
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура НайтиСоздатьКонтрагентаИДоговорДляПлатежногоСервисаЮКассаНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен реквизит ""Организация"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		
		Возврат;	
	КонецЕсли;
	
	ДанныеКонтрагента = ОнлайнОплатыСлужебный.ДанныеЭквайераПоУмолчанию(Новый Структура("ДатаНачала", ТекущаяДатаСеанса()));
	КонтрагентЭквайера = Справочники.Контрагенты.ПустаяСсылка();
	ЭлектронныеДокументыБГУ.СсылкаНаОбъектПоИННКПП("Контрагенты",
		ДанныеКонтрагента.ИНН, ДанныеКонтрагента.КПП, КонтрагентЭквайера, ТекущаяДатаСеанса());
	Если НЕ ЗначениеЗаполнено(КонтрагентЭквайера) Тогда
		РеквизитыКонтрагента = Новый Структура;
		РеквизитыКонтрагента.Вставить("ИНН", ДанныеКонтрагента.ИНН);
		РеквизитыКонтрагента.Вставить("КПП", ДанныеКонтрагента.КПП);
		РеквизитыКонтрагента.Вставить("Наименование", ДанныеКонтрагента.Наименование);
		РеквизитыКонтрагента.Вставить("НаименованиеСокращенное", ДанныеКонтрагента.Наименование);
		РеквизитыКонтрагента.Вставить("КодОКПО", ДанныеКонтрагента.ОКПО);
		РеквизитыКонтрагента.Вставить("ТипКонтрагента", Справочники.ТипыКонтрагентов.НайтиПоКоду("4"));
		
		ЭлектронныеДокументыБГУ.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, КонтрагентЭквайера);
		Если НЕ ЗначениеЗаполнено(КонтрагентЭквайера) Тогда
			ОписаниеОшибки = НСтр("ru='Не удалось заполнить контрагента-эквайера.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	Объект.Эквайер = КонтрагентЭквайера;
	
	РеквизитыДоговора = Новый Структура;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		РеквизитыДоговора.Вставить("Организация", Объект.Организация);
	КонецЕсли;
	РеквизитыДоговора.Вставить("Владелец", КонтрагентЭквайера);
	
	ДоговорКонтрагента = ИнтеграцияССервисомПриемаПлатежейБГУ.ДоговорКонтрагентаПоставщика(РеквизитыДоговора);
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		РеквизитыДоговора = Новый Структура;
		РеквизитыДоговора.Вставить("Наименование",НСтр("ru='Основной договор'"));
		РеквизитыДоговора.Вставить("Организация", Объект.Организация);
		РеквизитыДоговора.Вставить("Контрагент", КонтрагентЭквайера);
		РеквизитыДоговора.Вставить("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		
		ИнтеграцияССервисомПриемаПлатежейБГУ.СоздатьОсновнойДоговорПоРеквизитам(РеквизитыДоговора, ДоговорКонтрагента);	
	КонецЕсли;	
	Объект.ДоговорЭквайринга = ДоговорКонтрагента;
	
	Объект.Наименование = НСтр("ru='Эквайринг ЮКасса'");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКассовуюСсылкуПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовСБП();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступностьЭлементовСБП()
	
	ЕстьКассоваяСсылка = ЗначениеЗаполнено(Объект.КассоваяСсылка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		ЭтаФорма.Элементы, "ГруппаПечатьКассовойСсылки", "Доступность", (Объект.ИспользоватьКассовуюСсылку И ЕстьКассоваяСсылка));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		ЭтаФорма.Элементы, "ГруппаКассоваяСсылка", "Доступность", Объект.ИспользоватьКассовуюСсылку);
	
КонецПроцедуры	

&НаКлиенте
Процедура КассоваяСсылкаПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовСБП();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКассовуюСсылку(Команда)
	
	ПолучитьКассовуюСсылкуСервер();		
	Если ЗначениеЗаполнено(Объект.КассоваяСсылка) Тогда 
		УстановитьДоступностьЭлементовСБП();
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры   

&НаСервере
Процедура ПолучитьКассовуюСсылкуСервер()
	
	НастройкаПодключения = ИнтеграцияССервисомПриемаПлатежейБГУ.НастройкиИнтеграцииСБП(Объект.Организация, Объект.Ссылка);
	Если НастройкаПодключения.ИнтеграцияДоступна Тогда 
		ПараметрыКассовойСсылки = ПереводыСБПc2b.КассоваяСсылка(НастройкаПодключения.Настройка);
		Если ЗначениеЗаполнено(ПараметрыКассовойСсылки.КодОшибки) Тогда 
			ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ПараметрыКассовойСсылки.СообщениеОбОшибке);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Иначе
			Объект.КассоваяСсылка 		= ПараметрыКассовойСсылки.КассоваяСсылка; 
			Объект.ИдентификаторОплаты 	= ПараметрыКассовойСсылки.ИдентификаторОплаты;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВывестиQRКодКассовойСсылки(Команда)
	
	ТабДокумент = ПолучитьQRКодКассовойСсылки();
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьQRКодКассовойСсылки()
	
	ДанныеСсылки = Новый Структура;
	ДанныеСсылки.Вставить("КассоваяСсылка"		, Объект.КассоваяСсылка);
	ДанныеСсылки.Вставить("ИдентификаторОплаты"	, Объект.ИдентификаторОплаты);
	ТабДокумент = ПереводыСБПc2b.КарточкаКассовойСсылки(ДанныеСсылки,Новый Структура("ТипПечати", ТипМакетаКассовойСсылки));
	Возврат ТабДокумент;
	
КонецФункции	

#КонецОбласти
